VPro/src/Reports/PaymentCalendar/PaymentCalendar.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>PaymentCalendar</name>
  <attributes>
    <name>DelayedPaymentsPeriod</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>FuturePaymentsPeriod</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>WorkingDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Report>

VPro/src/Reports/PaymentCalendar/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

// Procedure - "FillCheckProcessing" event handler.
//
Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	If DelayedPaymentsPeriod.StartDate > WorkingDate Then
		ErrorText = NStr("en='Overdue payment period cannot be more than the current date. Report generation is canceled.';ru='Период просроченных платежей не может быть больше текущей даты. Формирование отчета отменено.';vi='Kỳ thanh toán quá hạn không thể lớn hơn ngày hiện tại. Hủy bỏ lập báo cáo.'");
		CommonUseClientServer.MessageToUser(
			ErrorText,
			Undefined, // ObjectOrRef
			"DelayedPaymentsPeriod",
			"Report", // DataPath
			Cancel
		);
	EndIf;

	If FuturePaymentsPeriod.EndDate < WorkingDate Then
		ErrorText = NStr("en='Future payment period cannot be less than the current date. Report generation is canceled.';ru='Период будущих платежей не может быть меньше текущей даты. Формирование отчета отменено.';vi='Kỳ thanh toán sau này không thể nhỏ hơn ngày hiện tại. Hủy bỏ lập báo cáo.'");
		CommonUseClientServer.MessageToUser(
			ErrorText,
			Undefined, // ObjectOrRef
			"FuturePaymentsPeriod",
			"Report", // DataPath
			Cancel
		);
	EndIf;
		
EndProcedure // FillCheckProcessing()

#EndIf
